benchmark/experience-1/100ms-tmaret-002-fibers-unbounded-250.txt
Running 25s test @ http://localhost:8080/sync?cpuIterations=10000&idleDelay=70&fileLength=10000
  250 threads and 250 connections
  Thread calibration: mean lat.: 3488.444ms, rate sampling interval: 15122ms
  Thread calibration: mean lat.: 3435.578ms, rate sampling interval: 15040ms
  Thread calibration: mean lat.: 3734.132ms, rate sampling interval: 14188ms
  Thread calibration: mean lat.: 3481.472ms, rate sampling interval: 15106ms
  Thread calibration: mean lat.: 3705.948ms, rate sampling interval: 14180ms
  Thread calibration: mean lat.: 3480.996ms, rate sampling interval: 15114ms
  Thread calibration: mean lat.: 3698.472ms, rate sampling interval: 14180ms
  Thread calibration: mean lat.: 3186.407ms, rate sampling interval: 13549ms
  Thread calibration: mean lat.: 3501.824ms, rate sampling interval: 15114ms
  Thread calibration: mean lat.: 3503.808ms, rate sampling interval: 14163ms
  Thread calibration: mean lat.: 3702.844ms, rate sampling interval: 14180ms
  Thread calibration: mean lat.: 3484.306ms, rate sampling interval: 15114ms
  Thread calibration: mean lat.: 3257.539ms, rate sampling interval: 13557ms
  Thread calibration: mean lat.: 3706.724ms, rate sampling interval: 14188ms
  Thread calibration: mean lat.: 3732.028ms, rate sampling interval: 14180ms
  Thread calibration: mean lat.: 3510.393ms, rate sampling interval: 15155ms
  Thread calibration: mean lat.: 3697.216ms, rate sampling interval: 14172ms
  Thread calibration: mean lat.: 3500.001ms, rate sampling interval: 15155ms
  Thread calibration: mean lat.: 3727.788ms, rate sampling interval: 14172ms
  Thread calibration: mean lat.: 3477.241ms, rate sampling interval: 15097ms
  Thread calibration: mean lat.: 3521.560ms, rate sampling interval: 14147ms
  Thread calibration: mean lat.: 3211.349ms, rate sampling interval: 13541ms
  Thread calibration: mean lat.: 3839.168ms, rate sampling interval: 15728ms
  Thread calibration: mean lat.: 3854.148ms, rate sampling interval: 15728ms
  Thread calibration: mean lat.: 3512.054ms, rate sampling interval: 15155ms
  Thread calibration: mean lat.: 3803.840ms, rate sampling interval: 15728ms
  Thread calibration: mean lat.: 3508.912ms, rate sampling interval: 15147ms
  Thread calibration: mean lat.: 3816.994ms, rate sampling interval: 15720ms
  Thread calibration: mean lat.: 3510.086ms, rate sampling interval: 15147ms
  Thread calibration: mean lat.: 3817.847ms, rate sampling interval: 15720ms
  Thread calibration: mean lat.: 3509.232ms, rate sampling interval: 15147ms
  Thread calibration: mean lat.: 3741.060ms, rate sampling interval: 15712ms
  Thread calibration: mean lat.: 3235.382ms, rate sampling interval: 13508ms
  Thread calibration: mean lat.: 3764.100ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 3252.406ms, rate sampling interval: 13623ms
  Thread calibration: mean lat.: 3762.965ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 3491.751ms, rate sampling interval: 15114ms
  Thread calibration: mean lat.: 3272.201ms, rate sampling interval: 13623ms
  Thread calibration: mean lat.: 3799.069ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 3762.880ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 3489.545ms, rate sampling interval: 15106ms
  Thread calibration: mean lat.: 3760.064ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 3504.362ms, rate sampling interval: 15106ms
  Thread calibration: mean lat.: 3759.833ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 3386.262ms, rate sampling interval: 13623ms
  Thread calibration: mean lat.: 3758.835ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 3503.363ms, rate sampling interval: 15106ms
  Thread calibration: mean lat.: 3757.137ms, rate sampling interval: 15671ms
  Thread calibration: mean lat.: 3295.203ms, rate sampling interval: 13615ms
  Thread calibration: mean lat.: 3829.952ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 3304.038ms, rate sampling interval: 13615ms
  Thread calibration: mean lat.: 3756.420ms, rate sampling interval: 15671ms
  Thread calibration: mean lat.: 3525.034ms, rate sampling interval: 15040ms
  Thread calibration: mean lat.: 3793.292ms, rate sampling interval: 15720ms
  Thread calibration: mean lat.: 3381.792ms, rate sampling interval: 13615ms
  Thread calibration: mean lat.: 3715.494ms, rate sampling interval: 15663ms
  Thread calibration: mean lat.: 3734.067ms, rate sampling interval: 15663ms
  Thread calibration: mean lat.: 3394.611ms, rate sampling interval: 13615ms
  Thread calibration: mean lat.: 3439.376ms, rate sampling interval: 13615ms
  Thread calibration: mean lat.: 4969.676ms, rate sampling interval: 15532ms
  Thread calibration: mean lat.: 4133.731ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 4268.731ms, rate sampling interval: 16908ms
  Thread calibration: mean lat.: 3775.078ms, rate sampling interval: 15654ms
  Thread calibration: mean lat.: 4133.048ms, rate sampling interval: 15400ms
  Thread calibration: mean lat.: 4256.512ms, rate sampling interval: 16908ms
  Thread calibration: mean lat.: 4146.346ms, rate sampling interval: 15368ms
  Thread calibration: mean lat.: 4296.502ms, rate sampling interval: 15802ms
  Thread calibration: mean lat.: 4111.829ms, rate sampling interval: 15359ms
  Thread calibration: mean lat.: 4394.368ms, rate sampling interval: 16990ms
  Thread calibration: mean lat.: 4326.528ms, rate sampling interval: 15794ms
  Thread calibration: mean lat.: 4126.407ms, rate sampling interval: 15359ms
  Thread calibration: mean lat.: 3843.093ms, rate sampling interval: 13811ms
  Thread calibration: mean lat.: 4293.833ms, rate sampling interval: 15794ms
  Thread calibration: mean lat.: 4126.947ms, rate sampling interval: 15359ms
  Thread calibration: mean lat.: 4292.187ms, rate sampling interval: 15794ms
  Thread calibration: mean lat.: 4143.104ms, rate sampling interval: 15359ms
  Thread calibration: mean lat.: 4156.899ms, rate sampling interval: 15351ms
  Thread calibration: mean lat.: 4290.706ms, rate sampling interval: 15785ms
  Thread calibration: mean lat.: 4308.790ms, rate sampling interval: 15785ms
  Thread calibration: mean lat.: 4116.935ms, rate sampling interval: 15343ms
  Thread calibration: mean lat.: 4319.469ms, rate sampling interval: 15785ms
  Thread calibration: mean lat.: 4140.458ms, rate sampling interval: 15392ms
  Thread calibration: mean lat.: 3859.882ms, rate sampling interval: 13795ms
  Thread calibration: mean lat.: 4338.377ms, rate sampling interval: 15777ms
  Thread calibration: mean lat.: 3768.832ms, rate sampling interval: 13778ms
  Thread calibration: mean lat.: 4341.046ms, rate sampling interval: 15777ms
  Thread calibration: mean lat.: 4113.436ms, rate sampling interval: 15335ms
  Thread calibration: mean lat.: 4118.584ms, rate sampling interval: 15343ms
  Thread calibration: mean lat.: 4190.500ms, rate sampling interval: 15712ms
  Thread calibration: mean lat.: 4381.275ms, rate sampling interval: 16957ms
  Thread calibration: mean lat.: 4339.035ms, rate sampling interval: 15777ms
  Thread calibration: mean lat.: 3766.158ms, rate sampling interval: 13778ms
  Thread calibration: mean lat.: 4631.552ms, rate sampling interval: 16973ms
  Thread calibration: mean lat.: 3764.935ms, rate sampling interval: 13770ms
  Thread calibration: mean lat.: 3764.650ms, rate sampling interval: 13770ms
  Thread calibration: mean lat.: 4267.972ms, rate sampling interval: 15826ms
  Thread calibration: mean lat.: 4290.481ms, rate sampling interval: 15826ms
  Thread calibration: mean lat.: 4105.216ms, rate sampling interval: 15261ms
  Thread calibration: mean lat.: 4071.566ms, rate sampling interval: 15310ms
  Thread calibration: mean lat.: 3848.163ms, rate sampling interval: 13770ms
  Thread calibration: mean lat.: 4314.742ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 4286.385ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 4422.734ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 3756.487ms, rate sampling interval: 13754ms
  Thread calibration: mean lat.: 4415.778ms, rate sampling interval: 16826ms
  Thread calibration: mean lat.: 4302.610ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 4106.581ms, rate sampling interval: 15319ms
  Thread calibration: mean lat.: 4103.793ms, rate sampling interval: 15310ms
  Thread calibration: mean lat.: 4176.128ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 4417.929ms, rate sampling interval: 15810ms
  Thread calibration: mean lat.: 3841.564ms, rate sampling interval: 13754ms
  Thread calibration: mean lat.: 4094.264ms, rate sampling interval: 15294ms
  Thread calibration: mean lat.: 5944.627ms, rate sampling interval: 17416ms
  Thread calibration: mean lat.: 5908.172ms, rate sampling interval: 17416ms
  Thread calibration: mean lat.: 6037.094ms, rate sampling interval: 17416ms
  Thread calibration: mean lat.: 5907.353ms, rate sampling interval: 17416ms
  Thread calibration: mean lat.: 5775.639ms, rate sampling interval: 17285ms
  Thread calibration: mean lat.: 5904.076ms, rate sampling interval: 17399ms
  Thread calibration: mean lat.: 5329.762ms, rate sampling interval: 17039ms
  Thread calibration: mean lat.: 5902.233ms, rate sampling interval: 17399ms
  Thread calibration: mean lat.: 5939.097ms, rate sampling interval: 17399ms
  Thread calibration: mean lat.: 5181.518ms, rate sampling interval: 17039ms
  Thread calibration: mean lat.: 5183.566ms, rate sampling interval: 17039ms
  Thread calibration: mean lat.: 5817.036ms, rate sampling interval: 17399ms
  Thread calibration: mean lat.: 5184.984ms, rate sampling interval: 17022ms
  Thread calibration: mean lat.: 5351.502ms, rate sampling interval: 17039ms
  Thread calibration: mean lat.: 5898.547ms, rate sampling interval: 17399ms
  Thread calibration: mean lat.: 6034.022ms, rate sampling interval: 17399ms
  Thread calibration: mean lat.: 5241.698ms, rate sampling interval: 17022ms
  Thread calibration: mean lat.: 5878.886ms, rate sampling interval: 17350ms
  Thread calibration: mean lat.: 5366.468ms, rate sampling interval: 16990ms
  Thread calibration: mean lat.: 5159.936ms, rate sampling interval: 16990ms
  Thread calibration: mean lat.: 5245.952ms, rate sampling interval: 16973ms
  Thread calibration: mean lat.: 5303.453ms, rate sampling interval: 16990ms
  Thread calibration: mean lat.: 5736.550ms, rate sampling interval: 16162ms
  Thread calibration: mean lat.: 5214.916ms, rate sampling interval: 16973ms
  Thread calibration: mean lat.: 5874.790ms, rate sampling interval: 17350ms
  Thread calibration: mean lat.: 5154.894ms, rate sampling interval: 16973ms
  Thread calibration: mean lat.: 5320.940ms, rate sampling interval: 16973ms
  Thread calibration: mean lat.: 5153.004ms, rate sampling interval: 16973ms
  Thread calibration: mean lat.: 5301.878ms, rate sampling interval: 16973ms
  Thread calibration: mean lat.: 6062.899ms, rate sampling interval: 17317ms
  Thread calibration: mean lat.: 6340.494ms, rate sampling interval: 16252ms
  Thread calibration: mean lat.: 8221.696ms, rate sampling interval: 19120ms
  Thread calibration: mean lat.: 8040.448ms, rate sampling interval: 18006ms
  Thread calibration: mean lat.: 8222.720ms, rate sampling interval: 19120ms
  Thread calibration: mean lat.: 5989.376ms, rate sampling interval: 17317ms
  Thread calibration: mean lat.: 5838.592ms, rate sampling interval: 17088ms
  Thread calibration: mean lat.: 5603.793ms, rate sampling interval: 15998ms
  Thread calibration: mean lat.: 5548.125ms, rate sampling interval: 15990ms
  Thread calibration: mean lat.: 5838.762ms, rate sampling interval: 17121ms
  Thread calibration: mean lat.: 5856.972ms, rate sampling interval: 17301ms
  Thread calibration: mean lat.: 8023.040ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 8013.824ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 5207.670ms, rate sampling interval: 16908ms
  Thread calibration: mean lat.: 8015.872ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 6524.800ms, rate sampling interval: 16318ms
  Thread calibration: mean lat.: 8198.144ms, rate sampling interval: 19070ms
  Thread calibration: mean lat.: 8000.512ms, rate sampling interval: 17907ms
  Thread calibration: mean lat.: 5687.978ms, rate sampling interval: 16130ms
  Thread calibration: mean lat.: 8197.120ms, rate sampling interval: 19070ms
  Thread calibration: mean lat.: 8198.144ms, rate sampling interval: 19070ms
  Thread calibration: mean lat.: 5279.980ms, rate sampling interval: 16891ms
  Thread calibration: mean lat.: 7993.856ms, rate sampling interval: 17891ms
  Thread calibration: mean lat.: 8005.632ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 6370.432ms, rate sampling interval: 16261ms
  Thread calibration: mean lat.: 8196.096ms, rate sampling interval: 19070ms
  Thread calibration: mean lat.: 5199.478ms, rate sampling interval: 16891ms
  Thread calibration: mean lat.: 8005.632ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 8007.680ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 8054.784ms, rate sampling interval: 18956ms
  Thread calibration: mean lat.: 8002.560ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 5347.564ms, rate sampling interval: 16891ms
  Thread calibration: mean lat.: 8188.928ms, rate sampling interval: 19054ms
  Thread calibration: mean lat.: 8188.928ms, rate sampling interval: 19054ms
  Thread calibration: mean lat.: 6519.168ms, rate sampling interval: 16302ms
  Thread calibration: mean lat.: 5803.776ms, rate sampling interval: 17022ms
  Thread calibration: mean lat.: 5218.084ms, rate sampling interval: 16752ms
  Thread calibration: mean lat.: 7983.616ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 5805.312ms, rate sampling interval: 17055ms
  Thread calibration: mean lat.: 8039.424ms, rate sampling interval: 19054ms
  Thread calibration: mean lat.: 8186.880ms, rate sampling interval: 19054ms
  Thread calibration: mean lat.: 7977.472ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 6363.776ms, rate sampling interval: 16277ms
  Thread calibration: mean lat.: 5339.372ms, rate sampling interval: 16875ms
  Thread calibration: mean lat.: 5795.754ms, rate sampling interval: 17006ms
  Thread calibration: mean lat.: 8185.856ms, rate sampling interval: 19054ms
  Thread calibration: mean lat.: 5190.498ms, rate sampling interval: 16859ms
  Thread calibration: mean lat.: 8180.736ms, rate sampling interval: 19038ms
  Thread calibration: mean lat.: 5300.775ms, rate sampling interval: 16859ms
  Thread calibration: mean lat.: 6506.112ms, rate sampling interval: 16285ms
  Thread calibration: mean lat.: 5946.777ms, rate sampling interval: 17235ms
  Thread calibration: mean lat.: 5798.485ms, rate sampling interval: 17039ms
  Thread calibration: mean lat.: 6504.064ms, rate sampling interval: 16277ms
  Thread calibration: mean lat.: 6504.320ms, rate sampling interval: 16277ms
  Thread calibration: mean lat.: 5945.139ms, rate sampling interval: 17219ms
  Thread calibration: mean lat.: 5260.760ms, rate sampling interval: 16859ms
  Thread calibration: mean lat.: 5812.940ms, rate sampling interval: 17219ms
  Thread calibration: mean lat.: 5503.441ms, rate sampling interval: 15900ms
  Thread calibration: mean lat.: 5943.910ms, rate sampling interval: 17219ms
  Thread calibration: mean lat.: 5943.296ms, rate sampling interval: 17219ms
  Thread calibration: mean lat.: 5902.336ms, rate sampling interval: 17219ms
  Thread calibration: mean lat.: 6499.456ms, rate sampling interval: 16269ms
  Thread calibration: mean lat.: 6348.160ms, rate sampling interval: 16211ms
  Thread calibration: mean lat.: 6354.304ms, rate sampling interval: 16261ms
  Thread calibration: mean lat.: 5496.552ms, rate sampling interval: 15892ms
  Thread calibration: mean lat.: 5779.029ms, rate sampling interval: 16973ms
  Thread calibration: mean lat.: 8126.976ms, rate sampling interval: 19021ms
  Thread calibration: mean lat.: 6497.408ms, rate sampling interval: 16261ms
  Thread calibration: mean lat.: 5779.541ms, rate sampling interval: 16973ms
  Thread calibration: mean lat.: 5178.840ms, rate sampling interval: 16842ms
  Thread calibration: mean lat.: 5324.878ms, rate sampling interval: 16842ms
  Thread calibration: mean lat.: 5495.249ms, rate sampling interval: 15884ms
  Thread calibration: mean lat.: 5930.803ms, rate sampling interval: 17203ms
  Thread calibration: mean lat.: 6662.485ms, rate sampling interval: 17317ms
  Thread calibration: mean lat.: 4894.515ms, rate sampling interval: 15196ms
  Thread calibration: mean lat.: 5544.960ms, rate sampling interval: 15884ms
  Thread calibration: mean lat.: 5171.436ms, rate sampling interval: 16826ms
  Thread calibration: mean lat.: 6490.752ms, rate sampling interval: 16252ms
  Thread calibration: mean lat.: 5490.408ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 5929.779ms, rate sampling interval: 17203ms
  Thread calibration: mean lat.: 6489.472ms, rate sampling interval: 16252ms
  Thread calibration: mean lat.: 5488.360ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 5932.441ms, rate sampling interval: 17203ms
  Thread calibration: mean lat.: 5169.230ms, rate sampling interval: 16826ms
  Thread calibration: mean lat.: 6485.632ms, rate sampling interval: 16244ms
  Thread calibration: mean lat.: 8261.632ms, rate sampling interval: 19005ms
  Thread calibration: mean lat.: 8117.760ms, rate sampling interval: 19005ms
  Thread calibration: mean lat.: 7974.400ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 8162.304ms, rate sampling interval: 19005ms
  Thread calibration: mean lat.: 8259.584ms, rate sampling interval: 19005ms
  Thread calibration: mean lat.: 8113.664ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8259.584ms, rate sampling interval: 19005ms
  Thread calibration: mean lat.: 8259.584ms, rate sampling interval: 19005ms
  Thread calibration: mean lat.: 8111.616ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8111.616ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8112.640ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8255.488ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8111.616ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8253.440ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8110.592ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 7967.232ms, rate sampling interval: 17858ms
  Thread calibration: mean lat.: 8253.440ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8109.568ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8253.440ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8253.440ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 7966.208ms, rate sampling interval: 17858ms
  Thread calibration: mean lat.: 8154.112ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8107.520ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 8251.392ms, rate sampling interval: 18989ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.16s     3.95s   23.23s    57.67%
    Req/Sec     1.00      0.00     1.00    100.00%
  7958 requests in 25.18s, 77.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 24
Requests/sec:    316.10
Transfer/sec:      3.09MB